wdi30-ruby/app_mountains/app/controllers/mountains_controller.rb

  def index
    @mountains = Mountain.all
---
SELECT "mountains".* FROM "mountains"

  def show
    @mountains = Mountain.find params[:id]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.country = params[:country]
    mountain.height = params[:height]
    mountain.save
---
INSERT INTO "mountains" ("name", "country") VALUES (?, ?)  [["name", "Huangshan"], ["country", ""]]